Revit 2026 API

# ConcreteSealantType Enumeration

---

The enumerated type representing the permitted values for the asset property "ConcreteSealant" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConcreteSealantType
```
```vb
Public Enumeration ConcreteSealantType
```
```cpp
public enum class ConcreteSealantType
```
```fsharp
type ConcreteSealantType
```

| Member name | Value | Description |
| --- | --- | --- |
| Acrylic | 2 |  |
| Epoxy | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace